/*создаем генератор паролей, пользователю необходимо выбрать длину пароля*/

Console.Write("Введите длину пароля: ");
int lenght_pass=int.Parse(Console.ReadLine()); //переменная длины пароля

//задаем строковый массив из которого буудем рандомно вытаскивать символы для пароля
string[] symbol_pass = { "1", "2", "3", "4", "5", "6", "7", "8", "9", "B", "C", "D", "F", "G", "H", "J", "K", "L", "M", "N", "P", "Q", "R", "S", "T", "V", "W", "X", "Z", "b",
    "c", "d", "f", "g", "h", "j", "k", "m", "n", "p", "q", "r", "s", "t", "v", "w", "x", "z",
    "A", "E", "U", "Y", "a", "e", "i", "o", "u", "y" };

string password = ""; //строковая перемемнная для хранения сгенерированного пароля

Random rand = new Random(); //создаем "рандом" для выборки случайных символов из заполненного строкового массива

for(int i=0; i<lenght_pass; i++)
{
    password += symbol_pass[rand.Next(0, 57)]; //от 0 до 57, потому что такое к-во
                                               //символов хранит наш заполненный строковый массив
}

Console.WriteLine("Ваш пароль: "+password);